#+title: My Doom Emacs config and related notes
#+author: Artem Timofeev
#+property: header-args :tangle ~/.config/doom/config.el
#+startup: content
*** tflint
Runs from container
- Requirements ::
  - Image build: install plugins
  - Custom flycheck checker: mainline flycheck no longer supports latest tflint

- Build image ::
#+begin_src hcl :tangle ~/.config/doom/.tflint.hcl
plugin "terraform" {
  enabled = true
  preset = "all"
}
plugin "aws" {
    enabled = true
    version = "0.27.0"
    source  = "github.com/terraform-linters/tflint-ruleset-aws"
}
/*
plugin "aws-serverless" {
  enabled = true
  version = "0.3.2"
  source = "github.com/awslabs/serverless-rules"
}
,*/
#+end_src

#+begin_src dockerfile :tangle ~/.config/doom/Dockerfile
FROM ghcr.io/terraform-linters/tflint

COPY .tflint.hcl /data

RUN tflint --init
#+end_src

#+begin_src sh :tangle no
cd ~/.config/doom/
docker build . -t tflint-plugins
docker run --rm -i tflint-plugins -v
#+end_src

#+RESULTS:
| TFLint | version           | 0.48.0          |
| +      | ruleset.terraform | (0.4.0-bundled) |
| +      | ruleset.aws       | (0.27.0)        |

- Setup checker ::
#+begin_src elisp
(flycheck-define-checker terraform-tflint-custom
  "A custom Terraform checker using tflint.

See URL `https://github.com/wata727/tflint'."
  :command ("docker" "run" "--rm" "-i"
            "-v" (eval (concat (expand-file-name (custom/find-subproject-root "main.tf")) ":/data"))
            "-v" (eval (concat (expand-file-name tflint-custom-config) ":/.tflint.hcl"))
            "tflint-plugins" "--format=compact" "--config=/.tflint.hcl")
  :error-patterns
  ((info line-start   (optional (file-name)) ":" line ":" column ": notice - "  (message) line-end)
  (warning line-start (optional (file-name)) ":" line ":" column ": warning - " (message) line-end)
  (error line-start   (optional (file-name)) ":" line ":" column ": error - "   (message) line-end))
  :modes terraform-mode
  :next-checkers (terraform))
(add-to-list 'flycheck-checkers 'terraform-tflint-custom)
#+end_src

